Revit 2027 API
TextNode.FontName Property
 The name of the text font.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FontName { get; }
Public ReadOnly Property FontName As String
	Get
public:
property String^ FontName {
	String^ get ();
}
member FontName : string with get
Property Value
String
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace